'use string'

//1)
//обьясни своими словами что такое 'Подьем' в javascript

//Подъем это хостинг он означает обычное поведение Javascript

//2)
//можно ли использовать let перед ее обьявлением?

//нет, она приведет к ошибке

//3)
//можно ли использовать const перед ее обьявлением?

//нет, она приведёт к синтаксической ошибке

//4)
//что такое 'use strict'

//'use string' это строгий режим 

//5)
//можно ли использовать в строгом режиме необьявленные переменные?

//нет, нельзя

//6)
//где нужно писать 'use strict'?

//в начало скрипта

//7)
//запрещено ли использовать переменную без обьявления в строгом режиме?

//Использование переменной без его объявления не допускается

//8)
//запрещено ли использовать обьект без обьявления в строгом режиме?

//Использование объекта без его объявления не допускается

//9)
//запрещено ли удалять переменную/обьект без обьявления в строгом режиме?

//Удаление переменной (или объекта) запрещено

//10)
//запрещено ли удалять функцию строгом режиме?

//Удаление функции в строгом режиме запрещено.


//11)
//запрещено ли создавать одинаковые переменные в строгом режиме?

//создавать одинаковые имени параметра запрещено
